tristar-multicopters/MotorControl/src/GNR2_Firmware/revA/grn2_ra6t2_ftexboard/ra_gen/hal_data.c
iirfa_instance_ctrl_t g_iirfa1_ctrl;

const iir_cfg_t g_iirfa1_cfg =
{
    .channel         = 1,
    .p_extend        = NULL,
};

/* Instance structure to use this module. */
const iirfa_instance_t g_iirfa1 =
{
    .p_ctrl          = &g_iirfa1_ctrl,
    .p_cfg           = &g_iirfa1_cfg,
    .p_api           = &g_iir_on_iirfa
};
iirfa_instance_ctrl_t g_iirfa0_ctrl;

const iir_cfg_t g_iirfa0_cfg =
{
    .channel         = 0,
    .p_extend        = NULL,
};

/* Instance structure to use this module. */
const iirfa_instance_t g_iirfa0 =
{
    .p_ctrl          = &g_iirfa0_ctrl,
    .p_cfg           = &g_iirfa0_cfg,
    .p_api           = &g_iir_on_iirfa
};
poeg_instance_ctrl_t g_poeg1_ctrl;
const poeg_cfg_t g_poeg1_cfg =
{
    .trigger             = (poeg_trigger_t) ( POEG_TRIGGER_SOFTWARE),
    .polarity            = POEG_GTETRG_POLARITY_ACTIVE_HIGH,
    .noise_filter        = POEG_GTETRG_NOISE_FILTER_PCLKB_DIV_32,
    .channel             = 1,
    .ipl                 = (0),
    .p_callback          = PWMBreak2_IRQHandler,
    .p_context           = NULL,
#if defined(VECTOR_NUMBER_POEG1_EVENT)
    .irq       = VECTOR_NUMBER_POEG1_EVENT,
#else
    .irq       = FSP_INVALID_VECTOR,
#endif
};
/* Instance structure to use this module. */
const poeg_instance_t g_poeg1 =
{
    .p_ctrl        = &g_poeg1_ctrl,
    .p_cfg         = &g_poeg1_cfg,
    .p_api         = &g_poeg_on_poeg
};
poeg_instance_ctrl_t g_poeg0_ctrl;
const poeg_cfg_t g_poeg0_cfg =
{
    .trigger             = (poeg_trigger_t) (POEG_TRIGGER_PIN |  POEG_TRIGGER_SOFTWARE),
    .polarity            = POEG_GTETRG_POLARITY_ACTIVE_LOW,
    .noise_filter        = POEG_GTETRG_NOISE_FILTER_PCLKB_DIV_32,
    .channel             = 0,
    .ipl                 = (0),
    .p_callback          = PWMBreak1_IRQHandler,
    .p_context           = NULL,
#if defined(VECTOR_NUMBER_POEG0_EVENT)
    .irq       = VECTOR_NUMBER_POEG0_EVENT,
#else
    .irq       = FSP_INVALID_VECTOR,
#endif
};
/* Instance structure to use this module. */
const poeg_instance_t g_poeg0 =
{
    .p_ctrl        = &g_poeg0_ctrl,
    .p_cfg         = &g_poeg0_cfg,
    .p_api         = &g_poeg_on_poeg
};
dac_instance_ctrl_t g_dac3_ctrl;
const dac_extended_cfg_t g_dac3_ext_cfg =
{
    .enable_charge_pump   = 0,
    .data_format         = DAC_DATA_FORMAT_FLUSH_LEFT,
    .output_amplifier_enabled = 0,
    .internal_output_enabled = false,
};
const dac_cfg_t g_dac3_cfg =
{
    .channel             = 3,
    .ad_da_synchronized  = false,
    .p_extend            = &g_dac3_ext_cfg
};
/* Instance structure to use this module. */
const dac_instance_t g_dac3 =
{
    .p_ctrl    = &g_dac3_ctrl,
    .p_cfg     = &g_dac3_cfg,
    .p_api     = &g_dac_on_dac
};
dac_instance_ctrl_t g_dac2_ctrl;
const dac_extended_cfg_t g_dac2_ext_cfg =
{
    .enable_charge_pump   = 0,
    .data_format         = DAC_DATA_FORMAT_FLUSH_LEFT,
    .output_amplifier_enabled = 0,
    .internal_output_enabled = false,
};
const dac_cfg_t g_dac2_cfg =
{
    .channel             = 2,
    .ad_da_synchronized  = false,
    .p_extend            = &g_dac2_ext_cfg
};
/* Instance structure to use this module. */
const dac_instance_t g_dac2 =
{
    .p_ctrl    = &g_dac2_ctrl,
    .p_cfg     = &g_dac2_cfg,
    .p_api     = &g_dac_on_dac
};
#define RA_NOT_DEFINED (0) // TODO: Remove this after implementing all channels and groups.

                               #if (1) // Define Virtual Channel 0 if it's assigned to a scan group.
                               const adc_b_virtual_channel_cfg_t g_adc0_virtual_channel_0_cfg =
                               {
                                   .channel_id             = ADC_B_VIRTUAL_CHANNEL_0,

                                   .channel_cfg_bits.group             = (1),
                                   .channel_cfg_bits.channel           = (ADC_CHANNEL_0),
                                   .channel_cfg_bits.self_diag_enabled = ((ADC_CHANNEL_0) == ADC_CHANNEL_SELF_DIAGNOSIS),
                                   .channel_cfg_bits.sample_table_id   = ADC_B_SAMPLING_STATE_TABLE_0,

                                   .channel_control_a_bits.offset_table_id = ADC_B_USER_OFFSET_TABLE_SELECTION_DISABLED,
                                   .channel_control_a_bits.gain_table_id = ADC_B_USER_GAIN_TABLE_SELECTION_DISABLED,

                                   .channel_control_b_bits.addition_average_mode = (ADC_B_ADD_AVERAGE_OFF),
                                   .channel_control_b_bits.addition_average_count = ADC_B_ADD_AVERAGE_1,
                                   .channel_control_b_bits.compare_match_enable = false,

                                   .channel_control_c_bits.limiter_clip_table_id = ADC_B_LIMIT_CLIP_TABLE_SELECTION_NONE,
                                   .channel_control_c_bits.channel_resolution = (ADC_B_RESOLUTION_16_BIT),
                                   .channel_control_c_bits.data_sign_selection = ((ADC_CHANNEL_0) != ADC_CHANNEL_SELF_DIAGNOSIS),
                               };
                               #endif

                               #if (1) // Define Virtual Channel 1 if it's assigned to a scan group.
                               const adc_b_virtual_channel_cfg_t g_adc0_virtual_channel_1_cfg =
                               {
                                   .channel_id             = ADC_B_VIRTUAL_CHANNEL_1,

                                   .channel_cfg_bits.group             = (1),
                                   .channel_cfg_bits.channel           = (ADC_CHANNEL_2),
                                   .channel_cfg_bits.self_diag_enabled = ((ADC_CHANNEL_2) == ADC_CHANNEL_SELF_DIAGNOSIS),
                                   .channel_cfg_bits.sample_table_id   = ADC_B_SAMPLING_STATE_TABLE_0,

                                   .channel_control_a_bits.offset_table_id = ADC_B_USER_OFFSET_TABLE_SELECTION_DISABLED,
                                   .channel_control_a_bits.gain_table_id = ADC_B_USER_GAIN_TABLE_SELECTION_DISABLED,

                                   .channel_control_b_bits.addition_average_mode = (ADC_B_ADD_AVERAGE_OFF),
                                   .channel_control_b_bits.addition_average_count = ADC_B_ADD_AVERAGE_1,
                                   .channel_control_b_bits.compare_match_enable = false,

                                   .channel_control_c_bits.limiter_clip_table_id = ADC_B_LIMIT_CLIP_TABLE_SELECTION_NONE,
                                   .channel_control_c_bits.channel_resolution = (ADC_B_RESOLUTION_16_BIT),
                                   .channel_control_c_bits.data_sign_selection = ((ADC_CHANNEL_2) != ADC_CHANNEL_SELF_DIAGNOSIS),
                               };
                               #endif

                               #if (2) // Define Virtual Channel 2 if it's assigned to a scan group.
                               const adc_b_virtual_channel_cfg_t g_adc0_virtual_channel_2_cfg =
                               {
                                   .channel_id             = ADC_B_VIRTUAL_CHANNEL_2,

                                   .channel_cfg_bits.group             = (2),
                                   .channel_cfg_bits.channel           = (ADC_CHANNEL_6),
                                   .channel_cfg_bits.self_diag_enabled = ((ADC_CHANNEL_6) == ADC_CHANNEL_SELF_DIAGNOSIS),
                                   .channel_cfg_bits.sample_table_id   = ADC_B_SAMPLING_STATE_TABLE_0,

