tristar-multicopters/MotorControl/src/GNR2_Firmware/revA/grn2_ra6t2_ftexboard/ra_gen/hal_data.c
                                   .channel_control_a_bits.offset_table_id = ADC_B_USER_OFFSET_TABLE_SELECTION_DISABLED,
                                   .channel_control_a_bits.gain_table_id = ADC_B_USER_GAIN_TABLE_SELECTION_DISABLED,

                                   .channel_control_b_bits.addition_average_mode = (ADC_B_ADD_AVERAGE_OFF),
                                   .channel_control_b_bits.addition_average_count = ADC_B_ADD_AVERAGE_1,
                                   .channel_control_b_bits.compare_match_enable = false,

                                   .channel_control_c_bits.limiter_clip_table_id = ADC_B_LIMIT_CLIP_TABLE_SELECTION_NONE,
                                   .channel_control_c_bits.channel_resolution = (ADC_B_RESOLUTION_12_BIT),
                                   .channel_control_c_bits.data_sign_selection = ((ADC_CHANNEL_0) != ADC_CHANNEL_SELF_DIAGNOSIS),
                               };
                               #endif

                               #if (0) // Define Virtual Channel 35 if it's assigned to a scan group.
                               const adc_b_virtual_channel_cfg_t g_adc0_virtual_channel_35_cfg =
                               {
                                   .channel_id             = ADC_B_VIRTUAL_CHANNEL_35,

                                   .channel_cfg_bits.group             = (0),
                                   .channel_cfg_bits.channel           = (ADC_CHANNEL_0),
                                   .channel_cfg_bits.self_diag_enabled = ((ADC_CHANNEL_0) == ADC_CHANNEL_SELF_DIAGNOSIS),
                                   .channel_cfg_bits.sample_table_id   = ADC_B_SAMPLING_STATE_TABLE_0,

                                   .channel_control_a_bits.offset_table_id = ADC_B_USER_OFFSET_TABLE_SELECTION_DISABLED,
                                   .channel_control_a_bits.gain_table_id = ADC_B_USER_GAIN_TABLE_SELECTION_DISABLED,

                                   .channel_control_b_bits.addition_average_mode = (ADC_B_ADD_AVERAGE_OFF),
                                   .channel_control_b_bits.addition_average_count = ADC_B_ADD_AVERAGE_1,
                                   .channel_control_b_bits.compare_match_enable = false,

                                   .channel_control_c_bits.limiter_clip_table_id = ADC_B_LIMIT_CLIP_TABLE_SELECTION_NONE,
                                   .channel_control_c_bits.channel_resolution = (ADC_B_RESOLUTION_12_BIT),
                                   .channel_control_c_bits.data_sign_selection = ((ADC_CHANNEL_0) != ADC_CHANNEL_SELF_DIAGNOSIS),
                               };
                               #endif

                               #if (0) // Define Virtual Channel 36 if it's assigned to a scan group.
                               const adc_b_virtual_channel_cfg_t g_adc0_virtual_channel_36_cfg =
                               {
                                   .channel_id             = ADC_B_VIRTUAL_CHANNEL_36,

                                   .channel_cfg_bits.group             = (0),
                                   .channel_cfg_bits.channel           = (ADC_CHANNEL_0),
                                   .channel_cfg_bits.self_diag_enabled = ((ADC_CHANNEL_0) == ADC_CHANNEL_SELF_DIAGNOSIS),
                                   .channel_cfg_bits.sample_table_id   = ADC_B_SAMPLING_STATE_TABLE_0,

                                   .channel_control_a_bits.offset_table_id = ADC_B_USER_OFFSET_TABLE_SELECTION_DISABLED,
                                   .channel_control_a_bits.gain_table_id = ADC_B_USER_GAIN_TABLE_SELECTION_DISABLED,

                                   .channel_control_b_bits.addition_average_mode = (ADC_B_ADD_AVERAGE_OFF),
                                   .channel_control_b_bits.addition_average_count = ADC_B_ADD_AVERAGE_1,
                                   .channel_control_b_bits.compare_match_enable = false,

                                   .channel_control_c_bits.limiter_clip_table_id = ADC_B_LIMIT_CLIP_TABLE_SELECTION_NONE,
                                   .channel_control_c_bits.channel_resolution = (ADC_B_RESOLUTION_12_BIT),
                                   .channel_control_c_bits.data_sign_selection = ((ADC_CHANNEL_0) != ADC_CHANNEL_SELF_DIAGNOSIS),
                               };
                               #endif
#if (((1) == 1)||((1) == 1)||((2) == 1)||((2) == 1)||((2) == 1)||((2) == 1)||((2) == 1)||((0) == 1)||((0) == 1)||((0) == 1)||((0) == 1)||((0) == 1)||((0) == 1)||((0) == 1)||((0) == 1)||((0) == 1)||((0) == 1)||((0) == 1)||((0) == 1)||((0) == 1)||((0) == 1)||((0) == 1)||((0) == 1)||((0) == 1)||((0) == 1)||((0) == 1)||((0) == 1)||((0) == 1)||((0) == 1)||((0) == 1)||((0) == 1)||((0) == 1)||((0) == 1)||((0) == 1)||((0) == 1)||((0) == 1)||((0) == 1))
const adc_b_virtual_channel_cfg_t *const g_adc0_group_0_virtual_channels[] = {
                                  #if ((1) == 1)
                                      &g_adc0_virtual_channel_0_cfg,
                                  #endif

                                  #if ((1) == 1)
                                      &g_adc0_virtual_channel_1_cfg,
                                  #endif

                                  #if ((2) == 1)
                                      &g_adc0_virtual_channel_2_cfg,
                                  #endif

                                  #if ((2) == 1)
                                      &g_adc0_virtual_channel_3_cfg,
                                  #endif

                                  #if ((2) == 1)
                                      &g_adc0_virtual_channel_4_cfg,
                                  #endif

                                  #if ((2) == 1)
                                      &g_adc0_virtual_channel_5_cfg,
                                  #endif

                                  #if ((2) == 1)
                                      &g_adc0_virtual_channel_6_cfg,
                                  #endif

                                  #if ((0) == 1)
                                      &g_adc0_virtual_channel_7_cfg,
                                  #endif

                                  #if ((0) == 1)
                                      &g_adc0_virtual_channel_8_cfg,
                                  #endif

                                  #if ((0) == 1)
                                      &g_adc0_virtual_channel_9_cfg,
                                  #endif

                                  #if ((0) == 1)
                                      &g_adc0_virtual_channel_10_cfg,
                                  #endif

                                  #if ((0) == 1)
                                      &g_adc0_virtual_channel_11_cfg,
                                  #endif

                                  #if ((0) == 1)
                                      &g_adc0_virtual_channel_12_cfg,
                                  #endif

                                  #if ((0) == 1)
                                      &g_adc0_virtual_channel_13_cfg,
                                  #endif

                                  #if ((0) == 1)
                                      &g_adc0_virtual_channel_14_cfg,
                                  #endif

                                  #if ((0) == 1)
                                      &g_adc0_virtual_channel_15_cfg,
                                  #endif

                                  #if ((0) == 1)
                                      &g_adc0_virtual_channel_16_cfg,
                                  #endif

                                  #if ((0) == 1)
                                      &g_adc0_virtual_channel_17_cfg,
                                  #endif

                                  #if ((0) == 1)
                                      &g_adc0_virtual_channel_18_cfg,
                                  #endif

                                  #if ((0) == 1)
                                      &g_adc0_virtual_channel_19_cfg,
                                  #endif

                                  #if ((0) == 1)
                                      &g_adc0_virtual_channel_20_cfg,
                                  #endif

                                  #if ((0) == 1)
                                      &g_adc0_virtual_channel_21_cfg,
                                  #endif

                                  #if ((0) == 1)
                                      &g_adc0_virtual_channel_22_cfg,
                                  #endif

                                  #if ((0) == 1)
                                      &g_adc0_virtual_channel_23_cfg,
                                  #endif

                                  #if ((0) == 1)
                                      &g_adc0_virtual_channel_24_cfg,
                                  #endif

                                  #if ((0) == 1)
                                      &g_adc0_virtual_channel_25_cfg,
                                  #endif

                                  #if ((0) == 1)
                                      &g_adc0_virtual_channel_26_cfg,
                                  #endif

                                  #if ((0) == 1)
                                      &g_adc0_virtual_channel_27_cfg,
                                  #endif

                                  #if ((0) == 1)
                                      &g_adc0_virtual_channel_28_cfg,
                                  #endif

                                  #if ((0) == 1)
                                      &g_adc0_virtual_channel_29_cfg,
                                  #endif

                                  #if ((0) == 1)
                                      &g_adc0_virtual_channel_30_cfg,
                                  #endif

                                  #if ((0) == 1)
                                      &g_adc0_virtual_channel_31_cfg,
                                  #endif

                                  #if ((0) == 1)
                                      &g_adc0_virtual_channel_32_cfg,
                                  #endif

                                  #if ((0) == 1)
                                      &g_adc0_virtual_channel_33_cfg,
                                  #endif

                                  #if ((0) == 1)
                                      &g_adc0_virtual_channel_34_cfg,
                                  #endif

                                  #if ((0) == 1)
                                      &g_adc0_virtual_channel_35_cfg,
                                  #endif

                                  #if ((0) == 1)
                                      &g_adc0_virtual_channel_36_cfg,
                                  #endif
                                  };
                                  #endif
#if (((1) == 2)||((1) == 2)||((2) == 2)||((2) == 2)||((2) == 2)||((2) == 2)||((2) == 2)||((0) == 2)||((0) == 2)||((0) == 2)||((0) == 2)||((0) == 2)||((0) == 2)||((0) == 2)||((0) == 2)||((0) == 2)||((0) == 2)||((0) == 2)||((0) == 2)||((0) == 2)||((0) == 2)||((0) == 2)||((0) == 2)||((0) == 2)||((0) == 2)||((0) == 2)||((0) == 2)||((0) == 2)||((0) == 2)||((0) == 2)||((0) == 2)||((0) == 2)||((0) == 2)||((0) == 2)||((0) == 2)||((0) == 2)||((0) == 2))
const adc_b_virtual_channel_cfg_t *const g_adc0_group_1_virtual_channels[] = {
                                  #if ((1) == 2)
                                      &g_adc0_virtual_channel_0_cfg,
                                  #endif

                                  #if ((1) == 2)
                                      &g_adc0_virtual_channel_1_cfg,
                                  #endif

                                  #if ((2) == 2)
                                      &g_adc0_virtual_channel_2_cfg,
                                  #endif

                                  #if ((2) == 2)
                                      &g_adc0_virtual_channel_3_cfg,
                                  #endif

                                  #if ((2) == 2)
                                      &g_adc0_virtual_channel_4_cfg,
                                  #endif

                                  #if ((2) == 2)
                                      &g_adc0_virtual_channel_5_cfg,
                                  #endif

                                  #if ((2) == 2)
                                      &g_adc0_virtual_channel_6_cfg,
                                  #endif

